{
  "backend/main.mo": "Main backend actor implementing e-commerce functionality with user profiles, product management (CRUD with images), shopping cart, and order processing, using authorization mixins and access control for admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting implementation of six core features: product catalog, product details, shopping cart, checkout flow, admin panel, and store branding, all with high confidence and mapped test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration, describing the React application structure with TanStack Router, authentication, and UI components for the fairsart e-commerce store.",
  "frontend/index.css": "Tailwind CSS configuration defining warm earth-tone color palette using OKLCH color system with light and dark mode support, including custom CSS variables for background, foreground, primary, secondary, and other UI tokens.",
  "frontend/index.html": "HTML entry point for the fairsart application with viewport meta tag and module script loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, products, cart, checkout, admin) and wrapping the app with ThemeProvider and Toaster for notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying fairsart branding, copyright notice, and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Sticky header with fairsart logo, navigation links, shopping cart icon with item count badge, user profile display, login/logout button, and responsive mobile menu using Sheet component.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component providing consistent page structure with Header, main content area using Outlet, and Footer across all routes.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog component that prompts new users to enter their name during initial profile setup, with form validation and submission using the useSaveCallerUserProfile hook.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, admin checks, products (CRUD operations), and cart management with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, custom color variables for light/dark themes with warm earth tones, and font families (Cormorant Garamond for headings, Inter for body text).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page displaying a table of products with add/edit/delete actions, protected by authentication and admin role checks with appropriate access denied states.",
  "frontend/src/pages/AdminProductForm.tsx": "Form page for creating or editing products with image upload, price input, description fields, form validation, upload progress tracking, and admin access control.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page that displays cart items with quantity controls, allows removing items, shows order summary with totals, and provides checkout navigation. Requires authentication and handles empty cart states.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a form for shipping information (name, email, address) that validates inputs and submits orders. Redirects unauthenticated users or empty carts back to the cart page.",
  "frontend/src/pages/Home.tsx": "Landing page with a hero banner, three feature sections (handcrafted, sustainable, unique), and a call-to-action to browse products. Uses static imagery and links to the product catalog.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays order details including customer info, shipping address, items ordered, and total price after successful checkout. Provides navigation back to shopping or home.",
  "frontend/src/pages/ProductCatalog.tsx": "Product listing page with search functionality that filters products by name or description. Displays products in a responsive grid with images, names, descriptions, and prices.",
  "frontend/src/pages/ProductDetail.tsx": "Individual product detail page showing product image, name, price, and description with an add-to-cart button. Requires authentication and completed user profile before adding items to cart.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography (Cormorant Garamond serif, Inter sans), spacing, shadows, and accordion animations.",
  "project_state.json": "Project metadata for 'fairsart' e-commerce store defining 8 implemented features including product catalog, cart, checkout, admin panel, and artisan-themed design with warm earth tones."
}